<template>
	<view class="newsDetail-container">
		<view class="content-title">
			党课学习
		</view>
		
		<view class="content-content">
			随着全面从严治党深入推进，党中央对机关党建工作高度重视，中央和国家机关开始更多地关注机关党建工作分类指导工作。但是进入新时代，中央和国家机关党建也面临新形势、新任务和新要求，对加强机关党建工作分类指导的现实需求越来越强烈，急需探索分类指导的有效方法，解决机关党建工作中个性化问题，不断提高机关党建工作质量。
			
			习近平总书记在中央和国家机关党的建设工作会议上的明确提出：“中央和国家机关摊子大、类型多，职能各异，工作不平衡。要加强分类指导，科学精准施策，做到‘一把钥匙开一把锁’，不能搞‘一刀切’。要制定分类指导意见，增强机关党建工作的针对性和有效性。”在中共中央《关于加强和改进中央和国家机关党的建设的意见》中也指出，要坚持问题导向，加强分类指导，注重精准施策。加强党建工作分类指导不仅是中央和国家机关的重要政治任务，也是机关党建工作亟待破解的重大课题。
			
			加强机关党建工作分类指导的现实意义
			
			加强机关党建工作分类指导是中央和国家机关提升机关党建工作质量的现实需要。中央和国家机关内设机构和直属单位数量众多，涵盖不同类型部门和单位，各自所属基层党组织的性质并不同。机关内不同领域、不同工作性质、不同工作要求的党组织，其职责任务、运行规律、党建特色皆不尽相同。中央和国家机关只有加强党建工作分类指导，根据不同类型党组织的职责任务和特点规律，有针对性地指导党组织开展党建工作，才能有效地解决各类党组织具体的个性化问题，推动机关党建高质量发展。
			
			加强机关党建工作分类指导是中央和国家机关解决机关党建工作问题的迫切要求。机关党建工作容易出现的问题是上传下达不畅、上下一般粗、左右一个样的问题，没有分解细化、体现特色、探索创新，十九届中央巡视工作在对一些中央和国家机关的巡视反馈意见中，也提出机关党委对不同类型党组织分类指导不够的问题。深究其因，是我们对新时代机关党建工作研究还不够深入、机关党建顶层设计不够完善、缺乏深入跟踪指导和考核问效；基层党组织缺乏首创精神、活力不足，仍然存在重业务轻党建、重数量轻质量、重形式轻效果的现象。如何加强机关党建分类指导已经是机关党建工作中的亟待破解的难题。
			
			加强机关党建工作分类指导是中央和国家机关推动党建和业务工作深度融合的重要抓手。中央和国家机关针对不同类型基层党组织精准施策，可以促使各类党组织更加准确地把握中央精神、展现部门特色、落实业务工作，推动党建和业务工作深度融合，形成围绕中心抓党建、抓好党建促业务的良性循环；也可以激发各级党组织加强对本部门本单位党员和党建工作特点研究的主观能动性，不断增强基层党组织的组织力。
			
			科学合理划分党组织类型
			
			加强对党组织党建工作的分类指导，要坚持从实际出发，以科学合理划分党组织类型为基础。按照机关党组织建设“围绕中心、建设队伍、服务群众”的要求，结合各部门各单位职能性质和业务特点，可将机关党组织分为业务、行政、研究、后勤、老干部5个类型。
			
			根据不同党组织类型的特点，提出个性化工作要求，引导党组织创新性地完成党建工作的“自选动作”，体现党组织特色。比如业务型党组织要运用好党建和业务深度融合机制，鼓励党员自觉学习习近平新时代中国特色社会主义思想、中央最新文件精神，及时学习、学深学透、全面对标对表，及时将中央精神贯彻落实到政策制定和业务工作中，增强工作的时效性和针对性。行政型党组织要坚定党的政治立场，坚决贯彻党的路线方针政策，准确掌握中央有关文件精神和决策部署，研究提出贯彻落实的思路和举措。研究型党组织要强化意识形态理论研究、行业舆情信息的收集分析和研判，加强意识形态阵地建设和管理，大力宣传党的基本理论、路线、方略。后勤型党组织要教育引导党员勇于担当、甘于奉献、清正廉洁，积极做好机关保障工作，充分发挥基层党组织战斗堡垒作用和党员先锋模范作用。老干部型党组织要教育服务管理好老党员，引导他们继续发挥余热，为社会发展建设贡献力量。
			
			精准实施党建工作分类指导
			
			要在指导监督各支部完成党的理论政治学习、党内组织生活、各类党建活动等“规定动作”的基础上，指导各级党组织开展有特色的“自选动作”，将分类指导贯穿于各类党组织党建工作的全过程、各环节。
			
			一是要建立各级党组织工作联系点。机关党委根据不同类型党组织，选派专职党务干部兼任党建工作联络员，每名联络员联系1种类型党组织，对所联系党组织进行深度剖析、定向指导、精准施策。
			
			二是要强化日常指导。党建工作联络员要全方位参与党组织的政治理论学习、“三会一课”、主题党日活动、民主生活会、组织生活会及民主评议党员等党内组织生活，对党组织制定的年度工作计划进行严格把关，深入调研掌握党组织基本情况，指出具体问题，提出工作建议。
			
			三是要加强专题指导。党建工作联络员结合各类党组织的特点和个性化工作要求，指导党组织有针对性地开展党建和业务深度融合、支部党建品牌培育、模范单位创建、“业务精、零差错、创一流”活动等专项工作，突出党建工作的实效性。
			
			四是实行指导工作督办制度。制定联络员指导党建工作督办汇总表，联络员每季度统计汇总所联系党组织的党建工作问题，以工作提示、调研反馈、书面问询、当面约谈、情况通报等方式，督促整改。
			
			五是要发挥考核的“指挥棒”作用。制定《基层党组织工作考核评价办法》，根据不同类型党组织的业务特点和性质，细化党建考核要素，通过检查党组织各类党建活动成果、党建工作和“三会一课”组织生活季度报表、党组织年度工作总结、基层党组织组织生活记录本等，加强对各级党组织的工作考核，将考核结果同党组织及党务干部的评优评先有机衔接。
			
			六是要提升党务干部能力素质。利用机关党委委员、纪委委员会议，机关党委部门工作会议等，联络员汇报指导各类党组织党建工作情况，讨论问题、分享经验，提高解决实际问题的能力；举办党务干部培训班，加入党性教育、党的创新理论、党建知识等方面教学内容，对机关党委委员、机关纪委委员、各级党组织书记、党小组组长及机关党委专职党务干部等进行党建工作培训，提升党务干部指导工作的能力素质。
		</view>
		
		
		<view class="pinglun" @click="goPingLunDetail">
			<u-icon name="edit-pen" size="40"></u-icon>
			<u-input placeholder="说说你的看法" @click="goPingLunDetail"></u-input>
			<view class="icon">
				<u-icon name="chat-fill" size="40"></u-icon>
				<u-badge :count="count" :offset="[10, 10]"></u-badge>
			</view>
		</view>
		
	</view>
</template>

<script>
	export default {
		data() {
			return {
				count:"22",
			}
		},
		onLoad() {
			
		},
		methods: {
			goPingLunDetail(){
				uni.navigateTo({
					url:"../../library/PingLun/PingLun"
				})
			}
		}
	}
</script>

<style lang="less" scoped>
.newsDetail-container{
	width: 100%;
	height: 100%;
	padding: 30rpx;
	.content-title{
		width: 80%;
		text-align: center;
		margin: 0 auto;
		font-weight: 800;
		font-size: 18px;padding: 20rpx;
	}
	.content-pic{
		width: 500rpx;
		height: 500rpx;
		margin: 50rpx auto;
		image{
			width: 100%;
			height: 100%;
		}
	}
}
.pinglun{
	width: 100%;
	padding: 20rpx;
	height: 80rpx;
	display: flex;
	border-top: 2rpx solid #ccc;
	position: fixed;
	justify-content: space-between;
	align-items: center;
	background-color: #fff;
	bottom: 0;
}
</style>
